Repository: Alan-AMT/traknav_app
Catalog: lib/i18n/app_*.arb
Languages: es

# language
source: English
es: Español

# homeSidemenuTitle
source: Menu
es: Menú

# homeSidemenuHome
source: Home
es: Inicio

# homeSidemenuMap
source: Map
es: Mapa

# homeSidemenuProfile
source: My account
es: Mi cuenta

# homeSidemenuFavs
source: Favourites
es: Mis Favoritos

# homeSidemenuPlan
source: Trip plan
es: Plan de viaje

# homeSidemenuWeather
source: Weather
es: Clima

# homeSidemenuCustom
source: Customization
es: Personalización

# homeSidemenuRecommendations
source: Change recommendations
es: Modificar recomendaciones

# homeSidemenuLang
source: Change language
es: Modificar idioma

# homeSidemenuLangEs
source: Spanish
es: Español

# homeSidemenuLangEn
source: English
es: Inglés

# homeSidemenuTheme
source: {theme_value} theme
es: Modo {theme_value}

# homeSidemenuSupport
source: Help and support
es: Ayuda y soporte

# homeSidemenuQuestions
source: FAQ
es: Preguntas frecuentes

# homeSidemenuGuide
source: User guide
es: Manual de usuario

# homeSidemenuAboutUs
source: About us
es: Acerca de

# homeSidemenuSignOut
source: Sign out
es: Cerrar sesión

# homeSearchBar
source: Hi, Where are we going?
es: Hola, ¿A dónde vamos?

# homeAdviceUp
source: Find more places
es: Encuentra más lugares

# homeAdviceDown
source: around you
es: a tu alrededor

# homeAdviceDiscover
source: Discover now >
es: Descubrir ahora >

# homeRecomendedMore
source: View more
es: Ver más

# homeRecomendedTitle
source: Recommended
es: Recomendados

# homeNearlyTitle
source: Near me
es: Cercanos a mi

# homeCategoriesTitle
source: Categories
es: Categorias

# homeCategoriesComercioLocal
source: Local trade
es: Comercio Local

# homeCategoriesMuseos
source: Museums
es: Museos

# homeCategoriesHospedaje
source: Lodging
es: Hospedaje

# homeCategoriesParques
source: Parks
es: Parques

# homeCategoriesRestaurantes
source: Restaurants
es: Restaurantes

# homeCategoriesPersonalizadas
source: Personalized
es: Personalizadas

# homeCategoriesTiempo
source: Climate
es: Tiempo

# homeCategoriesPlanViaje
source: Trip plan
es: Plan Viaje

# homeCategoriesFavoritos
source: Favorites
es: Favoritos

# homeCategoriesHerramientas
source: Tools
es: Herramientas

# acercaDerechos
source: TRAKNAV. All rights reserved.
es: TRAKNAV. Todos los derechos reservados.

# signinWelcome
source: Welcome to
es: Bienvenido a

# signinTapTitle
source: Login
es: Iniciar Sesión

# signupTapTitle
source: Sign up
es: Registrarse

# signinForgotPass
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

# formEmail
source: Email
es: Correo Electrónico

# formPassword
source: Password
es: Contraseña

# formName
source: Name
es: Nombre

# formPhone
source: Phone number
es: Teléfono

# formSecureQuestion1
source: Name of your elementary school
es: ¿A que primaria fuiste?

# formSecureQuestion2
source: Where do you live?
es: ¿En qué ciudad vives?

# changeLanguageTitle
source: LANGUAGE
es: SELECCIONA TU IDIOMA

# formCity
source: Home City
es: Ciudad de orígen

# errorRequired
source: This is a mandatory field
es: Este campo es obligatorio

# errorEmail
source: Field must be a valid email name@example.com
es: Introduce un correo elecrónico válido nombre@ejemplo.com

# errorPhone
source: Field must be a valid phone number (10 digits)
es: Introduce un número de teléfono válido (10 dígitos)

# errorPassword
source: The password must have at least: - One lowercase letter. - One uppercase letter. - One digit, period (.), or asterisk (*). - Be at least 8 characters long.
es: La contraseña debe tener al menos: - Una letra minúscula. - Una letra mayúscula. - Un número - Ser de al menos 8 caracteres de longitud.

# failedSignIn
source: Failed to sign in. Check your password and try again
es: No pudimos iniciar sesión. Revisa tu contraseña e intenta de nuevo

# failedSignUp
source: Failed to create account. Try again
es: No crear tu cuenta. Intenta de nuevo

# recPopular
source: Most popular
es: Sitios populares

# recMuseum
source: Museums
es: Museos

# recRestaurants
source: Restaurants
es: Restaurantes

# recLocalCommerce
source: Local trade
es: Comercio local

# recHistorical
source: Historical
es: Patrimonio histórico

# recLodgment
source: Lodgment
es: Hospedaje

# recParks
source: Parks
es: Parques

# recGuided
source: Guided tours
es: Visitas guiadas

# recHello
source: Hello!
es: ¡Hola!

# recDescription
source: In order to personalize your recommendations correctly, tell us about your travel interests and preferences!
es: Para personalizar tus recomendaciones de manera óptima, ¡cuéntanos un poco sobre tus gustos e intereses en viajes!

# recSelected
source: selected
es: seleccionados

# recNextButton
source: Next
es: Siguiente

# recSkipButton
source: Skip
es: Omitir

# tripplanappbar
source: Trip Plan
es: Plan de viaje

# tripPlanMaintext
source: The travel plan allows you to select all the places of interest, later it will allow you to draw a route to visit them.
es: El plan de viaje te permite seleccionar todos los lugares de interes, posteriormente te permitira trazar una ruta para visitarlos.

# tripplanday
source: Day
es: Día

source: Edit trip plan
es: Editar plan de viaje

source: Create trip plan
es: Crear plan de viaje

# tripplanlist
source: My trip plans
es: Mis planes de viaje

# tripplanlistf
source: Finished
es: Completado

# tripplanlistu
source: Unfinished
es: Pendiente

# endTripPlan
source: Finish trip plan
es: Terminar plan de viaje

# tripplantext1
source: Plan your trip easily and efficiently.
es: Planifica tu viaje de manera fácil y eficiente.

# tripplantext2
source: Enter the length of your stay and start your adventure.
es: Ingresa la duración de tu estadía e inicia tu aventura.

# tripplannumberdays
source: Number of days
es: Número de Días

# tripplancreatebutton
source: Plan Trip
es: Planificar Viaje

# myTripPlans15
source: Plan name
es: Nombre del plan

# myTripPlans2
source: Number of days
es: Número de Días

# myTripPlans25
source: Number of days
es: Número de Días

# myTripPlans3
source: Start date
es: Fecha de inicio

# myTripPlans35
source: Start date
es: Fecha de inicio

# error1tripplan
source: The field is required
es: El campo es requerido

# error2tripplan
source: Must be a valid number of days
es: Debe ser un número válido de días

# error3tripplan
source: Only a maximum of 21 days is allowed
es: Solo se pueden máximo 21 días

# error4tripplan
source: Minimum 1 day
es: Mínimo 1 día

# error5tripplan
source: You cannot use a date before the current one
es: No puedes usar una fecha anterior a la actual

# error6tripplan
source: Your travel plan must be at least 1 day long
es: Tu plan de viaje debe tener al menos 1 día

# error7tripplan
source: Your travel plan can have a maximum of 21 days
es: Tu plan de viaje puede tener un máximo de 21 días

# error8tripplan
source: There can only be a maximum of 8 places per day. Add this place to another day
es: Solo puede haber máximo 8 lugares por día. Agrega este lugar a otro día

# error9tripplan
source: All days of your plan must have assigned places
es: Todos los días de tu plan deben tener lugares asignados

# error10tripplan
source: We were unable to create your travel plan. Try again
es: No pudimos crear tu plan de viaje. Intenta de nuevo

# search2
source: Search Place
es: Buscar Lugar

# search3
source: Write the name of the place...
es: Escribe el nombre del lugar...

# agregar1
source: Add Place
es: Agregar Lugar

# agregar2
source: Add
es: Agregar

# agregar3
source: Add day
es: Agregar día

# imageerror1
source: Error loading image
es: Error al cargar la imagen

# imageerror2
source: Could not load image
es: No se pudo cargar la imagen

# borrardia
source: Delete day
es: Eliminar día

# mensajehist1
source: You do not have completed travel plans yet
es: Aún no tienes planes de viaje completados

# mensajehist2
source: Be sure to mark them as 'completed' on the 'My travel plans' page
es: Asegurate de marcarlos como 'completado' en la página 'Mis planes de viaje'

# mensajelist1
source: You don't have travel plans yet
es: Aún no tienes planes de viaje

# mensajelist2
source: You can create one on the 'Create travel plan' page
es: Puedes crear uno en la página 'Crear plan de viaje'

# tripplanhistory
source: History
es: Historial

# createPlanDialogTitle
source: Trip plan created
es: Crear plan de viaje

# warningSelectCity
source: Please select a city
es: Por favor selecciona una ciudad

# explorePlansButton
source: Explore plans
es: Explorar planes

# failedFetchPlans
source: Failed to get trip plans. Try again
es: No pudimos obtener tus planes de viaje. Intenta de nuevo

# searchPlans
source: Search
es: Buscar

source: Copy plan
es: Copiar plan

# createPlanDialogMessage
source: You can edit on ''My trip plans''
es: Podrás editarlo en la sección ''Mis planes de viaje''

# cancel
source: Canel
es: Cancelar

# confirm
source: Ok
es: Aceptar

# navBarTitle
source: FREQUENTLY ASKED QUESTIONS
es: PREGUNTAS FRECUENTES

# mainBtnTitle
source: GENERAL QUESTIONS
es: PREGUNTAS GENERALES

# mainBtnText
source: Resolve your doubts with this compilation of frequently asked questions
es: Resuelve tus dudas con esta recopilación de preguntas más frecuentes

source: CONTACT US
es: CONTÁCTANOS

source: QUESTIONS ABOUT:
es: PREGUNTAS ACERCA DE:

# usrProfile
source: User Profile
es: Perfil de Usuario

# generalInfo
source: General Information
es: Información General

# tecProblems
source: Technical Problems
es: Problemas Técnicos

# privPolicies
source: Privacy Policies
es: Políticas de Privacidad

# hwEditProfile
source: How to edit my User Profile?
es: ¿Cómo editar mi perfil de usuario?

# hwEditProfileAns
source: You can edit your user profile by accessing the details of your account through the round icon in the upper right corner of the main screen. Once in your account details, you just have to tap on 'edit'
es: Puedes editar tu perfil de usuario accediendo a los detalles de tu cuenta a través del ícono redondo de la ezquina superior derecha de la pantalla principal. Una vez en los detalles de tu cuenta solo tienes que hacer tap en 'editar'

# hwResetPass
source: How to reset my password?
es: ¿Cómo reestablezco mi contraseña?

# hwResetPassAns
source: Resetting the password is one of the modifications you can make when editing your profile, so you need to access the edit profile
es: Reestablecer contraseña es una de las modificaciones que puedes hacer al editar tu perfil, por lo que tienes que acceder a editar perfil

# plansAndTrips
source: Are my travel plans public?
es: ¿Mis planes de viaje son públicos?

# plansAndTripsAns
source: No, your plans and trips are private and are stored in your user account. Plans can be shared on social networks, but it is not mandatory to do so
es: No, tus planes y viajes son privados y se almacenan en tu cuenta de usuario. Los planes se pueden compartir por redes sociales, pero no es obligatorio hacerlo

# hwCustomAcc
source: How to customize my User Account?
es: ¿Cómo personalizar mi cuenta?

# hwCustomAccAns
source: If you didn't set your preferences when creating your account or if you want to change them, you just need to access the 'modify recommendations' section in the hamburger menu
es: Si no configuraste tus preferencias a la hora de crear tu cuenta o deseas cambiarlas, solo tienes que acceder al apartado de 'modificar recomendaciones' del menú de hamburguesa

# gnralInfo1
source: About the customization of my account
es: Sobre la personalización de mi cuenta

# gnralInfoAns1
source: You can customize your account through the configuration of your preferences when creating it, or by tapping on the 'modify recommendations' option located in the hamburger menu
es: Puedes personalizar tu cuenta a través de la configuración de tus preferencias a la hora de crearla, o bien, haciendo tap en la opción 'modificar recomendaciones' ubicada en el menú de hambrguesa

# gnralInfo2
source: About the most important features of the application
es: Sobre las funcionalidades más importantes de la aplicación

# gnralInfoAns2
source: Some of the standout features of TrakNav include: creating and editing travel plans, saving travel plans, viewing current weather and its forecast for the next 5 days, changing the language, and many more!
es: Algunas de las funcionalidades más destacadas de TrakNav son: crear y editar planes de viaje, guardar planes de viaje, visualizar clima actual y su pronóstico en los 5 días siguientes, modificar el idioma, ¡y muchas más!

# gnralInfo3
source: About travel plans
es: Acerca de los planes de viaje

# gnralInfoAns3
source: TrakNav users can create and modify travel plans, which can span up to 3 days. Once the plan is completed, it is saved for the user to remember the places they visited and the order in which they did so. Additionally, the travel plan can be shared on social networks
es: Los usuarios de TrakNav pueden crear planes de viaje y modificarlos, estos planes pueden ser de hasta 3 días. Una vez concluido el plan, este se guarda para que el usuario pueda recordar a los lugares que fue y el orden en que lo hizo. Además, se puede compartir el plan de viaje por redes sociales

# gnralInfo4
source: About the user manual
es: Sobre el manual de usuario

# gnralInfoAns4
source: The user manual is a guide for the user to understand in detail all the functionalities available in the system. This manual can be found in the last options of the hamburger menu
es: El manual de usuario es una guía para que el usuario conozca a detalle todas las funcionalidades disponibles en el sistema. Este manual se encuentra en las últimas opciones del menú de hamburguesa

# technicalProb1
source: I can't view the weather
es: No puedo visualizar el clima

# technicalProbAns1
source: Make sure you have an internet connection. If you can't view the weather in the desired location, try moving the location to a nearby area
es: Asegurate de tener conexión a internet. Si no puedes visualizar el clima en la ubicación deseada, prueba moviendo la ubicación a una zona cercana

# technicalProb2
source: The map is not loading
es: El mapa no carga

# technicalProbAns2
source: Check your internet connection. If the map still cannot load, try waiting and then try again; there may be issues with the connection to the Google service
es: Verifica tu conexión a internet. Si aún así no puede cargar el mapa, intenta esperar y después vuélvelo a intentar, seguramente haya problemas con la conexión al servicio de Google

# technicalProb3
source: My travel plan is not saving
es: Mi plan de viaje no se guarda

# technicalProbAns3
source: Make sure you have an internet connection when saving the travel plan
es: Asegurate de tener conexión a internet a la hora de gardar el plan de viaje

# privPolicies1
source: How does our application protect the privacy of users?
es: ¿Cómo protege nuestra aplicación la privacidad de los usuarios?

# privPoliciesAns1
source: Through access control using private accounts belonging to the user in question. It is the user's responsibility to share their password to access the application
es: A través del control de acceso mediante cuentas privadas pertenecientes al usuario en cuestión. Es responsabilidad del usuario el compartir su contraseña para acceder a la aplicación

# privPolicies2
source: What type of information is collected?
es: ¿Qué tipo de información se recopila?

# privPoliciesAns2
source: We only collect the information provided when creating the account, and it is to tailor a more personalized user experience. As part of a system functionality, travel plans are also saved
es: Solamente recopilamos la información proporcionada a la hora de crear la cuenta, y es para adaptar una experiencia de usuario más personalizada. Como parte de una funcionalidad del sistema, también se guardan los planes de viaje

# privPolicies3
source: Do we share the collected information with third parties?
es: ¿Se comparte la información recopilada a terceros?

# goToPlaceButton
source: Go to
es: Ir a

# placeDetailsButton
source: Details
es: Detalles

# miCuenta
source: My Account
es: Mi Cuenta

# editBtn
source: Edit
es: Editar

# correoTxtField
source: E-mail:
es: Correo:

# ciudadTxtField
source: City:
es: Ciudad:

# telTxtField
source: Phone:
es: Teléfono:

# nameTxtField
source: Name
es: Nombre

# nameTxtFieldErr
source: The name must not contain digits or special characters
es: El nombre no debe contener dígitos ni caracteres especiales

# ciudadTxtFieldErr
source: No city contains those special characters
es: ninguna ciudad contiene esos caracteres especiales

# telTxtFieldErr
source: Enter a valid number. You may enter the area code optionally by adding a + and up to 3 digits. If you entered the area code, there should be a space, then input the number (8 to 10 digits)
es: Ingrese un número válido. Puede ingresar la Lada de manera opcional colocando un + y hasta 3 dígitos. Si ingresó la Lada, debe haber un espacio, luego coloque el número (de 8 a 10 dígitos)

# succMsg
source: Information updated successfully
es: Información actualizada exitosamente

# saveBtn
source: Save
es: Guardar

# weatherTitle
source: Weather
es: Clima

source: Sunny
es: Soleado

source: Cloudy
es: Nublado

# rainChance
source: % chance of rain
es: % de probabilidad de lluvia

# weekTitle
source: Week
es: Semana

# temperaturaDia
source: Temperature
es: Temperatura

# chanceRainDia
source: ch. of rain:
es: Prob. lluvia:

# myFavorites
source: My favourites
es: Mis favoritos

source: Delete site
es: Eliminar sitio

# unknown
source: Unkown
es: Desconocido

source: Opened
es: Abierto

source: Closed
es: Cerrado

# shareButton
source: Share
es: Compartir

# copiedToClipboard
source: Link copied to clipboard.
es: Enlace copiado al portapapeles.
